Repository: JuezUN/INGInious
Catalog: inginious/frontend/i18n/*/LC_MESSAGES/messages.po
Languages: es

source: The accessibility end date must be greater than the start date.
es: La fecha límite de acceso debe ser mayor a la fecha de inicio.

source: The feedback below will be hidden to the students until {}.
es: El siguiente contenido estará oculto para los estudiantes hasta {}.

source: A part of this feedback is hidden until {}. Please come back later and reload the submission to see the full feedback.
es: Una parte de esta retroalimentación esta oculto hasta {}. Regresa después a esta página y actualiza la tarea enviada para consultar toda la retroalimentación.

source: Toggle diff
es: Alternar panel de diferencias

source: <p>Input preview: {title_input}</p> <pre class="input-area" id="{block_id}-input">{input_text}</pre> <div id="{title_input}_download_link"></div> <script>createDownloadLink("{title_input}");</script>
es: <p>Vista previa de la entrada: {title_input}</p> <pre class="input-area" id="{block_id}-input">{input_text}</pre> <div id="{title_input}_download_link"></div> <script>createDownloadLink("{title_input}");</script>

source: <p>Custom feedback</p><pre>{custom_feedback}</pre><br>
es: <p>Retroalimentación personalizada</p><pre>{custom_feedback}</pre><br>

source: <b>Parsing failed</b>: <pre>{}</pre>
es: <b>El parsing ha fallado</b>: <pre>{}</pre>

source: **Compilation error**:
es: **Error en compilación**:

source: <br><strong>{}:</strong> There was an error while running your notebook: <br><pre>{}</pre><br>
es: <br><strong>{}:</strong> Hubo un error mientras se ejecutaba el notebook: <br><pre>{}</pre><br>

source: Expand test results
es: Expandir resultados del test

source: <br><strong>Custom feedback:</strong><br><pre>{custom_feedback}</pre>
es: <br><strong>Retroalimentación personalizada:</strong><br><pre>{custom_feedback}</pre>

source: <br><strong>Output difference:</strong><pre>{case_output_diff}</pre><br>
es: <br><strong>Diferencia en la salida estándar:</strong><pre>{case_output_diff}</pre><br>

source: <ul class="list_disc" style="font-size:12px; list-style-type: square;"><li> <strong>Case {case_id}:</strong><a class="btn btn-default btn-link btn-xs" role="button" data-toggle="collapse" href="#{case_panel_id}" aria-expanded="false"aria-controls="{case_panel_id}">Show debug info</a> <div class="collapse" id="{case_panel_id}">{debug_info}</div></li></ul>
es: <ul class="list_disc" style="font-size:12px; list-style-type: square;"><li> <strong>Caso {case_id}:</strong><a class="btn btn-default btn-link btn-xs" role="button" data-toggle="collapse" href="#{case_panel_id}" aria-expanded="false"aria-controls="{case_panel_id}">Mostrar información de depuración</a> <div class="collapse" id="{case_panel_id}">{debug_info}</div></li></ul>

source: <strong>Executed code:</strong><pre class="language-python"><code class="language-python" data-language="python">{case_code}</code></pre><script>highlight_code();</script>
es: <strong>Código ejecutado:</strong><pre class="language-python"><code class="language-python" data-language="python">{case_code}</code></pre><script>highlight_code();</script>

source: code
es: código fuente

source: single-line code
es: línea de código fuente

source: file upload
es: enviar archivo

source: multiple choice
es: opciones múltiples

source: match
es: coincidencia

source: No deadline
es: Sin fecha de envío

source: It's too late
es: Demasiado tarde

source: Couldn't register to the specified group.
es: El usuario no se registró al grupo seleccionado.

source: You are not allowed to change group.
es: El usuario no está autorizado a cambiar de grupo.

source: You're not registered in a group.
es: Usted no está registrado en ningún grupo.

source: Missing LTI session id
es: El identificador de la sesión LTI no está disponible

source: Invalid LTI session id
es: Identificador de la sesión LTI es inválido

source: Invalid LTI data
es: El dato LTI es inválido

source: Your account is already bound with this context.
es: Tu cuenta ya está ligada a este contenido.

source: Error while validating LTI request
es: Error durante la validación de la petición LTI

source: In order to send grade back to the TC, UNCode needs the parameters lis_outcome_service_url and lis_outcome_result_id in the LTI basic-launch-request. Please contact your administrator.
es: Para enviar la evaluación al TC, UNCode necesita los atributos lis_outcome_service_url y lis_outcome_result_id en la petición LTI basic-launch-request. Contacte a su administrador para más detalles.

source: Couldn't validate LTI request
es: La petición LTI es invalida

source: The activation hash is invalid. Your user account may already be activated.
es: Código de activación inválido. Es posible que tu cuenta ya se encuentre activa.

source: You are now activated. You can proceed to login.
es: Cuenta activada. Ahora puedes iniciar una sesión.

source: Invalid username format.
es: El formato del nombre de usuario es invalido.

source: Invalid email format.
es: El formato del correo electrónico es inválido.

source: Password too short.
es: La contraseña no contiene el mínimo de caracteres.

source: Passwords don't match !
es: ¡Las contraseñas no coinciden!

source: This username is already taken !
es: ¡El nombre de usuario ya existe!

source: This email address is already in use !
es: ¡La dirección de correo electrónico ya existe!

source: Welcome on UNCode
es: Bienvenido a UNCode

source: Welcome on UNCode ! To activate your account, please click on the following link :
es: ¡Bienvenido a UNCode! Para activar tu cuenta, haz clic en el siguiente enlace:

source: You can check the data policy here:
es: Puedes consultar la política de tratamiento de datos aquí:

source: You are successfully registered. An email has been sent to you for activation.
es: Ahora estas registrado. Un correo electrónico ha sido enviado para activar tu cuenta.

source: Something went wrong while sending you activation email. Please contact the administrator.
es: Ocurrió un error durante el envío del correo de activación de tu cuenta. Contacta al administrador.

source: This email address was not found in database.
es: El correo electrónico no se encontró en la base de datos.

source: UNCode password recovery
es: Recuperación de la contraseña de UNCode

source: Dear {realname}, Someone (probably you) asked to reset your UNCode password. If this was you, please click on the following link :
es: Saludos {realname}, Ha realizado una petición para actualizar su contraseña en UNCode. Si usted realizó esta petición, por favor diríjase al siguiente enlace:

source: An email has been sent to you to reset your password.
es: Un correo electrónico ha sido enviado para cambiar tu contraseña.

source: Something went wrong while sending you reset email. Please contact the administrator.
es: Ocurrió un error durante el envío del correo para cambiar tu contraseña. Contacta al administrador.

source: Invalid reset hash.
es: El cambio del hash es inválido.

source: Your password has been successfully changed.
es: La contraseña ha sido actualizada con éxito.

source: You are not allowed to submit for this task.
es: Usted no esta autorizado para enviar esta tarea.

source: Your task has been regenerated. This current task is outdated.
es: Esta tarea ha sido reinicializada y no está disponible.

source: Please answer to all the questions and verify the extensions of the files you want to upload. Your responses were not tested.
es: Responda a todas las preguntas y verifique que las extensiones de los archivos enviados sean correctas. Estas respuestas no han sido verificadas.

source: <b>Your submission has been sent...</b>
es: <b>Su petición ha sido enviada...</b>

source: Internal error
es: Error interno

source: <b>UNCode is currently grading your answers.<b/> (almost done)
es: <b>UNCode está evaluando tus respuestas.<b/> (finalizando)

source: <b>UNCode is currently grading your answers.<b/> (Approx. wait time:
es: <b>UNCode está evaluando tus respuestas.<b/> (Tiempo aproximado:

source: seconds)
es: segundos)

source: <b>You are next in the waiting queue!</b>
es: <b>¡Eres el siguiente en la lista de espera!</b>

source: <b>There is one task in front of you in the waiting queue.</b>
es: <b>Hay una tarea más en la lista de espera.</b>

source: <b>There are
es: <b>Hay

source: tasks in front of you in the waiting queue.</b>
es: tareas más en la lista de espera.</b>

source: There are some errors in your answer. Your score is
es: Tu respuesta contiene algunos errores. Tu calificación actual es

source: Your answer passed the tests! Your score is
es: ¡Tu respuesta es exitosa! Tu calificación es

source: Your submission timed out. Your score is
es: El tiempo de tu petición se ha terminado. Tu calificación es

source: Your submission made an overflow. Your score is
es: Tu respuesta ha generado un "overflow" (desbordamiento) en memoria. Tu calificación es

source: Your submission was killed.
es: Tu envío ha sido terminado.

source: An internal error occurred. Please retry later. If the error persists, send an email to the course administrator.
es: Ha ocurrido un error interno, intenta más tarde. Si el error persiste, envía un correo electrónico al administrador del curso.

source: "Late submission: it does not affect the grade."
es: "Envío después de la fecha límite: no afecta la calificación."

source: Late submission
es: Envío posterior

source: <p>A penalty of <b>
es: <p>Fue aplicada una penalización de <b>

source: </b> was applied to this submission.</p>
es: </b>.</p>

source: [Submission #
es: [Envío de evaluación #

source: Classroom with id
es: Salon con identificador

source: not found.
es: no encontrado.

source: Team with id
es: Grupo con identificador

source: not found.
es: no encontrado.

source: You can't remove your default classroom.
es: No se puede suprimir el grupo inicial (creado por defecto).

source: Classroom updated.
es: Actualización del grupo.

source: Changes couldn't be applied for following students :
es: La actualización no se llevó a cabo para los siguientes estudiantes:

source: Teams updated.
es: Los equipos fueron actualizados.

source: An error occurred while parsing the data.
es: Un error ha ocurrido durante la validación de la sintaxis.

source: New classroom created.
es: Un nuevo grupo fue creado.

source: Default classroom changed.
es: El grupo inicial (creado por defecto) ha cambiado.

source: Invalid classroom selected.
es: El grupo seleccionado es inválido.

source: You have no rights to add/change classrooms
es: No tienes los privilegios suficientes para cambiar o agregar grupos

source: User returned an invalid form.
es: El usuario generó un formato inválido.

source: Classroom not found.
es: El grupo no fue encontrado.

source: Operation aborted due to invalid token.
es: La operación se ha interrumpido debido a que el "token" es inválido.

source: Wrong course id.
es: El identificador del curso es incorrecto.

source: All course data have been deleted.
es: La información de los cursos ha sido suprimida.

source: An error occurred while dumping course from database.
es: Un error ha ocurrido durante el intento de suprimir el curso de la base de datos.

source: Course restored to date :
es: El curso será restaurado en la siguiente fecha:

source: An error occurred while restoring backup.
es: Un error ha ocurrido durante la restauración de tus datos.

source: An error occurred while deleting the course data.
es: Un error ha ocurrido durante la supresión de datos del curso.

source: taskid/username
es: id de la tarea/nombre de usuario

source: taskid/aggregation
es: id de la tarea/agregación

source: username/taskid
es: nombre de usuario/id de la tarea

source: aggregation/taskid
es: agregación/id de la tarea

source: Selected submissions were set for replay.
es: Las tareas seleccionadas fueron inicializadas.

source: Task with id
es: La tarea con el identificador

source: does not exist !
es: no existe!.

source: Invalid name
es: Nombre inválido

source: You cannot remove yourself from the administrators of this course
es: No puede eliminarse de la lista de administradores para este curso

source: Invalid accessibility dates
es: Las fechas de accesibilidad son inválidas

source: Invalid registration dates
es: Las fechas de registro son inválidas

source: Invalid ACL value
es: El valor de ACL es inválido

source: LTI keys must be alphanumerical.
es: Las llaves LTI deben ser alfanuméricas.

source: Number of submissions
es: Número de tareas

source: Evaluation submissions (Total)
es: Evaluación de las tareas (total)

source: Evaluation submissions (Succeeded)
es: Evaluación de las tareas (con éxito)

source: Evaluation submissions (Failed)
es: Evaluación de las tareas (han fallado)

source: User was successfully removed
es: El usuario fue removido satisfactoriamente.

source: Username nor email was not found with an already existing account in UNCode
es: Ni el nombre de usuario, ni el correo corresponden a una cuenta existente en UNCode

source: User was successfully added
es: El usuario fue añadido satisfactoriamente

source: User could not be registered due to internal server error
es: Usuario no pudo ser registrado debido a un error interno del servidor

source: Submitted on
es: Envío realizado el

source: User
es: Usuario

source: Grade
es: Calificación

source: Task id
es: Identificador de la tarea

source: selected submissions were set for replay.
es: tareas seleccionadas fueron inicializadas.

source: No submissions found
es: No se encontraron envíos

source: The result contains more than
es: La consulta contiene más de

source: submissions. The displayed submissions are truncated.
es: envíos. El número total de envíos no se muestra por completo.

source: You can not use spaces in the tag id field.
es: No puede usar espacios in campo id

source: Invalid tag id:
es: El identificador de la etiqueta es inválido:

source: Some tags have the same id! The id of a tag must be unique.
es: ¡Algunas etiquetas contienen el mismo identificador! El identificador de cada tarea debe ser único.

source: Invalid file type:
es: El tipo de archivo es inválido:

source: You cannot create a task without subproblems
es: No puede crear una tarea sin subproblemas

source: Grade weight must be a floating-point number
es: La calificación debe de ser un número real

source: The number of stored submission must be a number!
es: ¡El número de envios almacenados de ser un numero válido!

source: The number of stored submission must be positive!
es: ¡El número de envios almacenados de ser positivo!

source: Invalid submission limit!
es: ¡El límite de tareas es inválido!

source: Your browser returned an invalid form (
es: Tu navegador web muestra una forma inválida (

source: Error while reading course's information
es: Error durante la consulta de información del curso

source: Invalid data:
es: Información inválida:

source: Cannot read zip file. Files were not modified
es: El archivo comprimido (zip) no se puede leer. Los archivos no fueron alterados

source: There was a problem while extracting the zip archive. Some files may have been modified
es: Hubo un error durante la extracción del archivo comprimido (zip). Algunos archivos pudieron ser alterados

source: Task File System doesn't exist
es: El sistema de archivos de la tarea no existe

source: Invalid path, it must start with a "/"
es: Ruta inválida. Debe comenzar con "/"

source: Invalid path, it can't be a relative path
es: Ruta inválida. No puede ser una ruta relativa

source: Invalid path, it already exists in File System
es: Ruta inválida. Ya existe en el sistema de archivos

source: Not Allowed
es: No permitido.

source: An error occurred while writing the file
es: Ha ocurrido un error durante la escritura del archivo

source: An error occurred while moving the files
es: Ha ocurrido un error durante el cambio de directorio de los archivos

source: An error occurred while deleting the files
es: Ha ocurrido un error eliminando los archivos

source: Course settings
es: Configuración del curso

source: Students
es: Estudiantes

source: Classrooms
es: Grupos

source: Teams
es: Equipos

source: Tasks
es: Tareas

source: View submissions
es: Ver tareas

source: Download submissions
es: Descargar tareas

source: Replay submissions
es: Reinicializa las tareas

source: Danger zone
es: Zona de peligro

source: Incorrect authentication binding.
es: La autenticación a otro servicio ha fallado.

source: You must set a password before removing all bindings.
es: Debes proveer una contraseña antes de eliminar las dependencias a otros servicios.

source: The specified email is incorrect.
es: El formato del correo electrónico es incorrecto.

source: Username already taken
es: El nombre de usuario ya existe, utiliza otro nombre

source: Incorrect email.
es: El formato del correo electrónico es incorrecto.

source: Profile updated.
es: Tu perfil ha sido actualizado.

source: Incorrect old password.
es: La contraseña previa es incorrecta.

source: Incorrect username.
es: El nombre de usuario es incorrecto.

source: Name is too short.
es: El nombre no tiene el mínimo número de caracteres.

source: My profile
es: Mi perfil

source: Authentication bindings
es: Enlaces de autenticación

source: Delete my account
es: Eliminar mi cuenta

source: About us
es: Sobre nosotros

source: Data Policy
es: Política de tratamiento de datos

source: Personal Data Policy
es: Política de tratamiento de datos personales

source: The data processing policy establishes the terms in which UNCode uses and saves the user provisioned information when using the software system. UNCode is committed to the users data security. We ensure that all the data that the owner provides to, will only be used according to the established terms in this document, and with the law 1581 of 2012. However, we suggest checking frequently the page to make sure you agree with the eventual changes that may be made to the data policy in the future.
es: La política de tratamiento de datos establece los términos en que UNCode utiliza y guarda la información proporcionada por el usuario cuando utiliza el sistema de software. UNCode está comprometido con la seguridad de los datos de los usuarios. Nos aseguramos de que todos los datos que el titular proporcione, sólo serán utilizados de acuerdo con los términos establecidos en este documento, y con la ley 1581 de 2012. Sin embargo, le sugerimos revisar con frecuencia la página para asegurarse de que está de acuerdo con los eventuales cambios que se puedan realizar en la política de datos en el futuro.

source: Goal
es: Objetivo

source: Set the criteria for the collection, storage, use, movement and deletion of the personal data processed by UNCode. Such as treatment for assessment, decisions making, and observation and study.
es: Fijar los criterios para la recogida, almacenamiento, uso, circulación y supresión de los datos personales procesados por UNCode. Como el tratamiento para evaluación, toma de decisiones, observación y estudio.

source: Scope
es: Alcance

source: The policy applies for the personal data registered in the UNCode databases, who acts as the responsible of the personal data processing.
es: La política aplica para los datos personales registrados en las bases de datos de UNCode, que actúan como responsables del tratamiento de los datos personales.

source: Liabilities
es: Obligaciones

source: This is a mandatory and strictly enforced policy for UNCode.
es: Esta es una política obligatoria y estrictamente aplicada para UNCode.

source: Processing responsible
es: Responsable del tratamiento

source: UNCode is a project developed by PLaS, a research group of the Universidad Nacional de Colombia, Bogotá headquarters.
es: UNCode es un proyecto desarrollado por PLaS, un grupo de investigación de la Universidad Nacional de Colombia, sede Bogotá.

source: Data processing
es: Tratamiento y finalidad

source: Personal data is collected through forms and interaction and development of tasks on the platform. The software system collect personal information as name, career, contact data as e-mail, and demographic information. Also the system collects information about each solution provided on problem as attempt state, errors type, code or notebook provided, date of submission, among others.
es: Los datos personales se recogen a través de formularios y de interacción y desarrollo de tareas en la plataforma. El sistema de software recopila información personal como nombre, carrera, datos de contacto como correo electrónico e información demográfica. También el sistema recopila información sobre cada solución proporcionada en el problema como estado, intento, tipo de error, código o cuaderno proporcionado, fecha de presentación, entre otros.

source: UNCode will execute the data processing through the collection, storage, use and circulation to:
es: El tratamiento que realizará UNCode con la información será la recolección, almacenamiento, uso, circulación para:

source: Evaluate and grade the knowledge communicated throughout the development of the courses.
es: Evaluar y calificar los conocimientos comunicados a lo largo del desarrollo de los cursos.

source: Decisions making about the pedagogical methodologies and resources used.
es: Toma de decisiones sobre las metodologías y recursos pedagógicos utilizados.

source: Monitoring, observation and study to help research processes.
es: Seguimiento, observación y estudio para ayudar a los procesos de investigación.

source: Data owners rights
es: Derechos de los titulares

source: As the owner of your personal data, you have the following rights:
es: Como titular de sus datos personales, usted tiene los siguientes derechos:

source: Have a free access to the provided data that have been processed.
es: Acceder de forma gratuita a los datos proporcionados que hayan sido objeto de tratamiento.

source: Read, update and verify the partial, incorrect and incomplete data that may cause error or whose processing is not allowed.
es: Leer, actualizar y verificar los datos que sean parciales, incorrectos e incompletos quepuedan causar error o cuyo tratamiento no esté permitido"

source: Present complaints for infractions to the provisions of current regulations or have not been authorized, at the Superintendencia de Industria y Comercio.
es: Presentar ante la Superintendencia de Industria y Comercio (SIC) quejas por infracciones a lo dispuesto en la norma vigente o no haya sido autorizado.

source: Request the proof of the granted authorization.
es: Solicitar el comprobante de la autorización otorgada.

source: Revoke the authorization and request the data deletion, while there is no legal or contractual duty that prevents them from being deleted.
es: Revocar la autorización y/o solicitar supresión del dato, siempre que no exista deber legal o contractual que impida eliminarlos.

source: Do not answer question about sensitive data. They will be optionals the answers about sensitive data, or children and adolescents data.
es: No responda preguntas sobre datos confidenciales. Serán opcionales las respuestas sobre datos sensibles, o datos de niños y adolescentes.

source: Requests, queries and claims attention
es: Atención de solicitudes, consultas y reclamos

source: UNCode is that agency who is responsible for processing of the data owners to make effective their rights. You can communicate by writing to the following email
es: UNCode es la dependencia que tiene bajo su cargo dar trámite a las solicitudes de los titulares para hacer efectivos sus derechos. Puede comunicarse escribiendo al siguiente correo:

source: Procedure for the exercise of the Habeas Data right
es: Procedimiento para el ejercicio del derecho de Habeas Data
