Repository: JuezUN/INGInious
Catalog: inginious/frontend/i18n/*/LC_MESSAGES/messages.po
Languages: es

source: <strong>Note:</strong> You must bind your account each time you access a new task in a course.
es: <strong>Nota:</strong> Debes crear un enlace cuando ingreses a una nueva tarea en un curso.

source: Create account
es: Crear la cuenta

source: Create a new UNCode account
es: Crear una nueva cuenta en UNCode

source: Your name:
es: Tu nombre:

source: No user data has been provided to create your account. If you entered the page manually or changed the language, please close this window and enter again from the link.
es: No se proporcionaron los datos para crear la cuenta. Si ingresaste manualmente a esta página o cambiaste el idioma, por favor cierra la pestaña e ingresa desde el enlace nuevamente.

source: Manual Scoring
es: Calificación manual

source: Feedback
es: Retroalimentación

source: Not available
es: No disponible

source: No grade
es: Sin calificar

source: The task was deleted
es: La tarea fue eliminada

source: The course does not exist or the user does not have permissions.
es: El curso no existe o el usuario no tiene permisos.

source: The file is not coded in UTF-8. Please change the encoding.
es: El archivo no está codificado en UTF-8. Por favor cambie la codificación.

source: The rubric is not well formatted. The JSON format is not correct, please check the file and upload it again.
es: La rúbrica no tiene un formato correcto. El formato JSON no es correcto, por favor revise el archivo y súbalo de nuevo.

source: Something went wrong while saving the rubric. Please try again.
es: Hubo un error mientras se guardaba la rúbrica. Por favor vuélvalo a intentar.

source: The rubric was successfully uploaded. The page will reload once you close the modal.
es: La rúbrica fue subida satisfactoriamente. La página se recargará una vez el modal se cierre.

source: The rubric is not well formatted. The uploaded rubric is empty.
es: La rúbrica no tiene un formato correcto. La rúbrica seleccionada está vacía.

source: The rubric is not well formatted. There are missing categories or grade levels in the rubric.
es: La rúbrica no tiene un formato correcto. Faltan categorías o niveles de calificación en la rúbrica.

source: The rubric is not well formatted. The number of categories (rows) must be the same for each grade level.
es: La rúbrica no tiene un formato correcto. El número de categorías (filas) debe ser el mismo para cada nivel de calificación.

source: The rubric is not well formatted. Not all the categories (rows) have the same name.
es: La rúbrica no tiene un formato correcto. No todas las categorías (filas) tienen el mismo nombre.

source: The rubric is not well formatted. There some values for the cells empty.
es: La rúbrica no tiene un formato correcto. Hay unos valores de celda vacíos.

source: Tasks List
es: Lista de tareas

source: Upload custom rubric
es: Subir rúbrica personalizada

source: Task Name
es: Nombre de la tarea

source: Students succeeded
es: Estudiantes exitosos

source: Students attempted
es: Estudiantes que intentaron

source: No Tasks with attempts Yet
es: La tarea no se ha intentado

source: Download
es: Descargar

source: Select a rubric to upload
es: Seleccionar una rúbrica a subir

source: Current rubric
es: Rúbrica actual

source: Save rubric
es: Guardar rúbrica

source: Feedback List
es: Lista de Retroalimentación

source: Feedback for:
es: Retroalimentación para:

source: Information
es: Información

source: Language
es: Lenguaje

source: Summary
es: Resumen de los resultados

source: Comments
es: Comentarios

source: Rubric
es: Rúbrica

source: Manual grade:
es: Calificación:

source: Task
es: Tarea

source: Student
es: Estudiante

source: Manual scoring for:
es: Calificación manual para:

source: Click to select and deselect
es: Haz click para seleccionar y doble click para desmarcar

source: Current Score:
es: Puntaje actual:

source: "Use RST format to write the comment"
es: "Utilice el formato RST para escribir el comentario"

source: Write
es: Escribir

source: Preview
es: Vista previa

source: Feedback for the course:
es: Retroalimentación para el curso:

source: Date
es: Fecha

source: Result Summary
es: Resumen de los resultados

source: Score
es: Puntaje

source: Manual scoring
es: Calificación manual

source: See submission
es: Ver envío

source: "It is possible that the grader could not finish its process with this submission."
es: "Es posible que el grader no pudiera terminar su proceso con este envío."

source: Manual scoring for Task:
es: Calificación manual para la tarea:

source: Best score
es: Mejor puntaje

source: Unknown
es: Desconocido

source: No Students Yet
es: Sin estudiantes

source: code file multiple languages
es: Múltiples lenguajes - Archivo de código

source: Code multiple languages
es: Múltiples lenguajes - Código

source: Custom test job not found. Try running the custom tests again.
es: Test personalizado no se encontró. Intente correr los tests personalizados de nuevo.

source: Custom tests are still running.
es: Tests personalizados aún están corriendo.

source: Please select at least 1 and up to 3 tests.
es: Por favor seleccione al menos 1 y hasta 3 tests

source: Custom tests are running.
es: Tests personalizados están corriendo.

source: An user must be logged in to run custom tests
es: El usuario debe tener la sesión iniciada para correr los tests personalizados.

source: A custom test is already pending for this task. Wait for a while to run the tests.
es: Un envío de tests personalizados está corriendo para esta tarea. Espere un tiempo para correr los tests.

source: Context
es: Contexto

source: Allowed file extensions
es: Extensiones de archivo permitidas

source: Maximum file size (in bytes)
es: Tamaño máximo del archivo (en Bytes)

source: Select all
es: Seleccionar todo

source: Type
es: Tipo

source: Code file multiple languages
es: Multiples lenguajes - Archivo de código

source: Paste your code or <a href='#' id='link-$inputId'>load it from file</a>
es: Pegue su código o <a href='#' id='link-$inputId'>cárguelo desde un archivo</a>

source: Select your language
es: Seleccione el lenguaje

source: About Python Notebook submissions
es: Acerca de submissions de Notebooks de Python

source: Internet access in grading environment
es: Acceso a internet en el ambiente de evaluación

source: Magic functionality execution
es: Ejecución de la funcionalidad 'Magic'

source: functions are not allowed when your notebook is graded. For example the next line
es: son funciones no permitidas al momento de la evaluación. Por ejemplo la siguiente línea

source: Commands execution
es: Ejecutar comandos

source: is turned into the following code:
es: es transformado en el siguiente código:

source: When you use Google Colaboratory (Colab) and you want to load and read data from Google Drive, you are required to use some python modules unique in Colab. These modules are not supported by UNCode. Then, make sure when you submit your notebook, you do not include it.
es: Cuando usa Google Colaboratory (Colab) y usa unos módulos específicos de Google Colab, estos no son soportados por UNCode. Asegúrese de que esos módulos no se incluyen al momento de realizar el submission.

source: Test notebook
es: Probar notebook

source: Select 1 and up to 3 tests to run
es: Por favor seleccione al menos 1 y hasta 3 tests

source: Run!
es: !Ejecutar!

source: Perform lint
es: Verificar código (linter)

source: Paste your input
es: Copie su entrada aquí

source: 'Your input goes here'
es: 'La entrada va aquí'

source: Your output goes here
es: La salida va aquí

source: Test code!
es: ¡Probar código!

source: Visualize your code!
es: ¡Visualizar código!

source: An error occurred while retrieving submission from task {}.
es: Un error ocurrió mientras se cargaban los submissions de la tarea {}.

source: There are not enough submissions for the selected language in the task: {}. At least 2 students must have submitted to compare.
es: No hay suficientes submissions para el lenguaje seleccionado en la tarea: {}. Al menos dos estudiantes deben haber enviado código a evaluar.

source: An error occurred while generating the plagiarism check.
es: Un error ocurrió mientras se generaba el chequeo de plagio.

source: Task environment is not available for plagiarism check: {}. Check the task is correctly configured.
es: El ambiente de la tarea no está disponible para chequeo de plagio: {}. Por favor asegúrese que la tarea está bien configurada.

source: Please fill all the fields.
es: Por favor complete todos los campos.

source: Language is not valid
es: Lenguaje no válido.

source: Base code is not present.
es: Código base no está presente.

source: Task environment is not allowed to generate a plagiarism check.
es: Ambiente de la tarea no permitido para generar chequeo de plagios.

source: Plagiarism
es: Plagio

source: New plagiarism check
es: Nuevo chequeo de plagio

source: Plagiarism checks by task
es: Chequeos de plagio por tarea

source: Task name
es: Nombre de la tarea

source: Status
es: Estado

source: Summary of plagiarism check
es: Resumen del chequeo de plagio

source: Created on
es: Creado en

source: Process finished with some errors while checking submissions
es: Proceso terminó con algunos errores en la revisión de envíos

source: Results available
es: Resultados disponibles

source: Generated files
es: Archivos generados

source: Task to check
es: Tarea a revisar

source: Base code file
es: Archivo de código base

source: Problem bank
es: Banco de problemas

source: Problem bank
es: Banco de problemas

source: "Administration"
es: "Administración"

source: Language is not available.
es: Lenguaje no disponible.

source: The file is not formatted as expected, check it is comma separated and emails are actual emails.
es: El archivo no tiene el formato esperado, revise que esté separado por comas y los correos son verdaderos.

source: The process finished with {0!s} students registered on the course and {1!s} students registered on UNCode out of {2!s} students listed in the file. The emails for the new students are being sent in the background, wait a while and check again that all the students were registered.
es: El proceso terminó con {0!s} estudiantes registrados en el curso y {1!s} estudiantes registrados en UNCode de un total del {2!s} estudiantes listados en el archivo. Los correos para los nuevos estudiantes están siendo enviados en segundo plano, por favor espere un tiempo y vuelva a revisar que todos los estudiantes hayan sido registrados.

source: <br><br>The next students were not registered because of an unexpected error, probably the user is already registered with another username, the username is already taken or the email address is already in use: {}
es: <br><br>Los siguientes estudiantes no fueron registrados debido a un error inesperado, es probable que el usuario ya esté registrado con otro nombre de usuario, que el nombre de usuario ya se haya tomado, o que la dirección de correo ya exista: {}

source: Welcome on
es: Bienvenido

source: Hello
es: Hola

source: You have been registered for the course:
es: Has sido registrado en el curso:

source: at Universidad Nacional de Colombia.
es: en la Universidad Nacional de Colombia.

source: If you have already activated your account, you can access to UNCode to start the course.
es: Si ya tienes activada tu cuenta, puedes acceder a UNCode para empezar el curso.

source: How to proceed?
es: ¿Como ingreso al curso?

source: When you logged in, you could see the main page with the courses that you are enrolled
es: Una vez inicies sesión con tus credenciales, podrás ver la página principal con los cursos en los que estás inscrito

source: Click on
es: Haz clic en

source: option on the course list or click this link:
es: en la lista de cursos o por medio de este enlace:

source: Now you can see the tasks of the course, you are ready.
es: ¡Ahora puedes acceder a las tareas del curso!.

source: See the UNCode's
es: Consulta nuestra

source: data policy
es: política de datos

source: To activate your account, please click on the following link:
es: Para activar tu cuenta, por favor sigue el siguiente enlace:

source: After you active the account, you can login to UNCode using next credentials:
es: Después de activar la cuenta, puedes iniciar sesión en UNCode usando las siguientes credenciales:

source: Remember to change your password in 'Preferences' option.
es: Recuerde cambiar su contraseña en la opción 'Preferencias'.

source: How to change the password?
es: ¿Como cambiar la contraseña?

source: In top nav bar, click on the option displaying your name.
es: En la barra superior, haga clic donde se muestra su nombre.

source: Click on 'Preferences' option.
es: Haz click en 'Preferencias'

source: Now you can change your password setting your current password and the new password.
es: Ahora puede cambiar la contraseña, poniendo la contraseña actual y la nueva contraseña.

source: How to authenticate using Google Authentication method?
es: ¿Cómo autenticarse usando una cuenta de Google?

source: Click on 'Preferences' option, this will display a page with a menu in the right side. Click on the 'Authentication binding' option.
es: Haz Clic en la opción 'Preferencias', esto mostrará una página con un menú en en el lado derecho. Selecciona la opción 'Enlaces de Autenticación'.

source: To add the Google Authentication method, select 'Google' then click on 'Add new binding' button.
es: Para agregar el método de autenticación de Google, selecciona 'Google' y haz click en el botón 'Agregar nuevo enlace'

source: After adding Google Authentication you can log in to UNCode using either the normal Authentication (username and password) or Google Authentication.
es: Después de esto, puedes iniciar sesión usando ya sea tu usuario y contraseña o con tu cuenta de Google.

source: Register students
es: Registrar estudiantes

source: Select a file to upload
es: Seleccionar archivo a subir

source: Email language:
es: Idioma del correo:

source: About the file
es: Archivo de salida

source: The uploaded file must be a <strong>CSV</strong> file. Make sure it is separated by commas.
es: El archivo subido debe ser un <strong>CSV</strong>. Asegúrese que esté separado por comas.

source: This file must contain the <strong>name,last name,username,email</strong> of each student you want to register.
es: El archivo debe contener los siguientes datos <strong>name,last name,username,email</strong> por cada uno de los estudiantes a registrar.

source: Statistics
es: Estadísticas

source: Course statistics
es: Estadísticas del curso

source: Grade count
es: Conteo de notas

source: Grade distribution
es: Distribución notas

source: Submissions Verdict
es: Veredicto envíos

source: Submissions Verdict (LATE)
es: Veredicto envíos (POSTERIOR)

source: Submissions Verdict (BEST)
es: Veredicto submissions (MEJOR)

source: Submissions by grade
es: Entregas por puntaje

source: Final grade distribution
es: Distribución de nota final

source: Toggle normalize
es: Alternar normalización

source: My statistics
es: Mis estadísticas

source: Trials and Best Grade
es: Intentos y mejor nota

source: Bar Submissions Per Tasks
es: Diagrama de barras de envíos por tarea

source: Bar Submissions Per Tasks (LATE)
es: Diagrama de barras de envíos por tarea (POSTERIOR)

source: Student's Tools
es: Herramientas de los Estudiantes

source: Task editorial
es: Editorial

source: Task tutorial
es: Tutorial de la tarea

source: Tutorial description
es: Descripción del tutorial

source: "Description in RST format. See task context help for more information"
es: "Descripción en formato RST. Para más información revisar ayuda del contexto de la tarea"

source: Task solution
es: Solución de la tarea

source: Solution language
es: Lenguaje del código

source: Solution code
es: Código de la solución

source: Select language
es: Seleccionar lenguaje

source: Solution notebook
es: Notebook solución

source: Solution notebook name
es: Nombre del notebook

source: No language
es: Sin lenguaje

source: Hints
es: Pistas

source: Some hints in task have empty content fields.
es: Hay pistas sin contenido en la tarea.

source: Some hints in task have empty title fields.
es: Hay pistas sin títulos en la tarea.

source: Penalty for hints must be between 0.0% and 100.0%.
es: La penalización de las pistas debe estar entre 0.0% y 100%.

source: Each hint penalty must be a float.
es: La penalización de las pistas debe ser un número decimal.

source: Invalid task name
es: Nombre de la tarea inválido

source: Task does not exist, or task has not been created yet.
es: La tarea no existe o la tarea aún no ha sido creada.

source: There was a problem to update submission mode on users hints.
es: Ocurrio un problema al actualizar el modo de la tarea en las pistas de los usuarios.

source: The course does not exist or the user does not have access.
es: El curso no existe o el usuario no tiene permisos.

source: The task does not exist in the course.
es: Esta tarea no existe en el curso.

source: The user is not registered in this course.
es: El usuario no está registrado a este curso.

source: An error occurred while getting the user's hints.
es: Un error ha ocurrido al obtener las pistas del usuario.

source: An error occurred while updating status of the hint. The hint does not exist in the database.
es: Un error ha ocurrido al actualizar la pista. La pista no existe en la base de datos.

source: Hint unlocked successfully.
es: La pista fue desbloqueada exitosamente

source: Create new hint
es: Crear una nueva pista

source: Hint title
es: Título de la pista

source: Penalty
es: Penalización

source: "Grade penalty for using the hint. You can set a penalty from 0.0% to 100.0%, which will reduce the student's final grade, in case they decide to see a given hint."
es: "Penalización que se aplica en la nota del estudiante cuando se utiliza la pista. La nota puede tener una penalización de 0.0% a 100%, en caso de que el estudiante desee acceder a esta."

source: Hint content
es: Contenido de la pista

source: Task hints
es: Pistas de la tarea

source: No penalty
es: Sin penalización

source: This task doesn't have hints to show
es: No hay pistas para esta tarea

source: Each hint is like a small help or suggestion with information that you can use to reach the solution more easily, this includes some code tips, theory, or processes that might help you to solve the problem. Try to solve the problem without unlocking the hints as they might reduce your task's final grade task.
es: Cada pista te da una pequeña ayuda o sugerencia con información para solucionar el problema más fácilmente, esto pueden tips sobre el código, conceptos a tener en cuenta, o procedimientos para obtener la solución. Intenta resolver el problema sin desbloquear las pistas, ya que estas podrían reducir tu nota final de la tarea.

source: To unlock a hint, select it and click on the <b>Get hint</b> button. However, some hints may have a penalty that will be applied on your final submission score, so be careful if you want to unlock them!.
es: Puedes desbloquear una pista al oprimir el botón <b>Desbloquear</b>. Ten en cuenta que algunas pistas pueden aplicar una penalización en tu calificación final, por lo tanto, ¡ten cuidado al desbloquearlas!.

source: <b>Note:</b> The sum of the hints penalties will we applied as a percentage of the total submission score.
es: <b>Nota:</b> Todas las penalizaciones se aplican como porcentajes a la calificación final.

source: Applied penalty
es: Penalización aplicada

source: Get Hint
es: Crear una nueva pista

source: Invalid email: the email was already taken.
es: Corre electrónico inválido: el corre electrónico ya fue tomado.

source: Invalid username: the username was already taken.
es: Nombre de usuario inválido: el nombre de usuario ya fue tomado.

source: "<li><a href='/user_management' class='navbar-link'> <i class="fa fa-user-plus" aria-hidden="true"></i> User Management</a></li>
es: "<li><a href='/user_management' class='navbar-link'> <i class="fa fa-user-plus" aria-hidden="true"></i> Gestión de usuarios</a></li>

source: Mongo operation fail
es: Fallo en la operación de Mongo

source: There are users' jobs running
es: Hay procesos de usuarios que se están ejecutando

source: Changes in your user account
es: Cambios en su cuenta de usuario

source: - If at some point you had authentication problems, it may be due to the change process.
es: - Si en algún momento has tenido problemas de autenticación, puede ser debido al proceso de de actualización.

source: - If you think some changes are wrong, please contact the administrator.
es: - Si cree que algún cambio es incorrecto, póngase en contacto con el administrador.

source: - We have noticed that you have not yet activated your account, please click on the following link:
es: - Hemos notado que aún no has activado la cuenta, por favor sigue el siguiente enlace:

source: Some changes have been made to your account:
es: Se han realizado algunos cambios en su cuenta:

source: To keep in mind:
es: Para tener en cuenta:

source: Something went wrong while trying to send the email with the information to the user
es: Algo salió mal al intentar enviar el correo electrónico con la información al usuario

source: Invalid email by format or already in use
es: Correo electrónico inválido por formato o ya está en uso

source: Invalid name by length
es: Nombre inválido por longitud

source: Invalid username by format or already in use
es: Nombre de usuario inválido por formato o ya está en uso

source: No data to change
es: No hay datos que modificar

source: Superadmin can not modify its own data
es: El superadministrador no puede modificar sus propios datos

source: User no found
es: Usuario no encontrado

source: User Management
es: Gestión de usuarios

source: The email is mandatory
es: El correo es obligatorio

source: There are no jobs running
es: No hay procesos de usuarios que se están ejecutando

source: No user found
es: Usuario no encontrado

source: User Information
es: Información del usuario

source: Done
es: Hecho

source: To Keep in Mind
es: Para tener en cuenta:

source: You do not need to be strict with the regular expression and specify which symbols are allowed
es: No necesitas ser estricto con las expresiones regulares y especificar cúales símbolos son permitidos

source: with <strong>student</strong> as parameter, for example, it returns results that include the parameter like <strong>student</strong>1 or something_<strong>student</strong>_something
es: Con <strong>student</strong> como parametro de busqueda, por ejemplo, se obtienen resultados que incluyen el parametro como <strong>student</strong>1 o algo_<strong>student</strong>_algo

source: All
es: Todo

source: Search
es: Búsqueda

source: CourseID
es: Identificador del curso

source: User Status
es: Estadísticas del usuario

source: "Number of open user sessions"
es: Número de sesiones de usuario activas

source: Manage User Data
es: Gestionar datos de usuario

source: Complete Name
es: Nombre completo:

source: Update User
es: Actualizar usuario

source: Update User Data
es: Actualizar datos de usuario

source: Are you sure you want to make this change?
es: ¿Estás seguro de que quieres hacer este cambio?

source: Type the username
es: Escriba el nombre de usuario

source: is mandatory
es: es obligatorio

source: Welcome
es: Bienvenido

source: Username or email
es: Nombre de usuario o correo electrónico

source: Lost password?
es: ¿Ha olvidado su contraseña?

source: Sign in with
es: Iniciar sesión con

source: Last tried exercises
es: Últimos intentos realizados

source: No submissions
es: No hay tareas enviadas

source: (current)
es: (actual)

source: Members
es: Integrantes

source: Groups
es: Grupos

source: Tutors
es: Tutores

source: My group
es: Mi grupo
