Repository: JuezUN/INGInious
Catalog: inginious/frontend/i18n/*/LC_MESSAGES/messages.po
Languages: es

source: For the protection of personal data, UNCode presents the following steps and minimum requirements for the exercise of your rights.
es: Para la protección de datos personales, UNCode presenta los siguientes pasos y requisitos mínimos para el ejercicio de sus derechos

source: Is necessary give the following information in order to attend your request:
es: Para la radicación y atención de sus solicitud, le solicitamos suministrar la siguiente información:

source: Complete name and last name.
es: Nombre completo.

source: Contact information.
es: Información de contacto

source: The max. provided term by the law to resolve your claim is fifteen (15) business days, from the day next to the date of the receipt. If it is not possible to attend the claim within these term, UNCode will inform of the reasons for the delay, and the attend date of your claim, which may not exceed eight (8) business days next to the expiration of the first term.
es: El término máximo previsto por la ley para resolver su reclamación es de quince (15) días hábiles, contado a partir del día siguiente a la fecha de su recibo. Cuando no fuere posible atender el reclamo dentro de dicho término, UNCode informará al interesado los motivos de la demora y la fecha en que se atenderá su reclamo, la cual en ningún caso podrá superar los ocho (8) días hábiles siguientes al vencimiento del primer término.

source: Validity
es: Vigencia

source: All the information provided will be kept as long as it is not requested for delete it, and that there is no legal duty to preserve it.
es: Los datos personales proporcionados se conservarán mientras no se solicite su supresión por el interesado y siempre que no exista un deber legal de conservarlos.

source: Delete all files
es: Borrar todos los archivos

source: Are you sure you want to delete all files?
es: ¿Estás seguro de que quieres eliminar todos los archivos?

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

source: Help related to the task context.
es: Ayuda relacionada al context de la tarea.

source: Here you will find some information related to the language
es: Aqui encontraras información relacionada con el lenguaje

source: and how you can use it to make a good description.
es: y cómo puede usarlo para crear buenas descripciones.

source: Bold text
es: Texto en negrita

source: **Text between will be stronger**.
es: **El texto en medio estará en negrita**.

source: Text between will be stronger.
es: El texto en medio estará en negrita.

source: Italic text
es: Texto en cursiva

source: *Text between will be rendered as italic*.
es: *El texto en medio será mostrado en estilo cursiva*.

source: Text between will be rendered as italic
es: El texto en medio será mostrado en estilo cursiva.

source: The area of a square is
es: El área del cuadrado es

source: The input format is <strong>LaTeX</strong>, math syntax without the "math delimiters". The example is rendered as:
es: El formato de entrada es <strong>LaTeX</strong>, notación matemática son el delimitador "math". El ejemplo se muestra como:

source: Monospaced text
es: Texto con espacio sencillo

source: Text between will be rendered as monospaced text.
es: Texto será mostrado con espacios sencillos.

source: Bullet list
es: Listas

source: Add image
es: Añadir imagen

source: The desired image will be rendered.
es: La imagen deseada será mostrada.

source: Remember that you have to put the task id and the image name. You have to upload the image in the tab <em>Task files</em>. This file must be in the <em>public/</em> folder.
es: Recuerde poner el id de la tarea y el nombre de la imagen. También, tiene que subir la imagen primero en <em>Archivos de tarea</em>, en la carpeta <em>/public/</em>

source: After the '.. raw:: html' you can add your HTML code.
es: Después de la expresión '.. raw:: html', puede agregar su código HTML.

source: The previous HTML code is rendered as follows
es: El anterior código se muestra como sigue

source: More information
es: Información

source: Close
es: Cerrar

source: Upload multiple files
es: Subir múltiples archivos

source: Files
es: Archivos

source: Files Path
es: Ruta de archivos

source: List of selected files
es: Lista de archivos seleccionados

source: Upload files
es: Subir archivos

source: Understanding your result
es: Entendiendo tus resultados

source: The tables below list all possible results.
es: Las siguientes tablas explican estos posibles resultados.

source: Awesome! Everything worked as it should have: your code passed all the test cases. Congratulations!
es: ¡Grandioso! Todo funcionó como se esperaba: tu código pasó todos los casos de prueba. ¡Felicitaciones!

source: The output after running your code (what it <i>prints</i> to the screen), is different from the output the system expected.
es: La salida después de ejecutar tu código (lo que se <i>imprime</i> en la pantalla), es diferente a la esperada.

source: If the administrator allowed it, you may be able to see the difference between your output and the expected output.
es: Si el administrador lo permitió, podrías mirar la diferencia entre tu salida y la esperada.

source: Test your code with different inputs. You can do it in your machine or you can use the "custom input" in the tools section.
es: Prueba tu código con diferentes entradas. Puedes hacerlo localmente o puedes usar la herramienta "Probar código" en el botón de herramientas.

source: Missing/excessive blank lines or unnecessary spaces are likely to have caused this message.
es: Ausentes/excesivos saltos de línea o espacios innecesarios probablemente causaron este mensaje.

source: Your code exceeded the time limit. Thus, your code took too long to run the input for a given test case.
es: Tu código excedió el tiempo límite, por ende tomó mucho tiempo para finalizar un caso de prueba dado.

source: There are two options: either your code got stuck in an infinite loop or your code takes much longer than it should.
es: Hay dos opciones: ya sea que tu código se quedó en un ciclo infinito o que tu código toma más tiempo del que debería.

source: Getting this result means your code is using too much memory at runtime.
es: Tu código toma mucha memoria en tiempo de ejecución.

source: Getting this result means the output of your code is longer that the allowed.
es: Esto significa que la salida de tu código es más grande de lo permitido.

source: Error related to notebook file submissions. This points out a runtime error while running the grading testing code.
es: Error relacionado a submissions de Notebooks. Esto indica un error en tiempo de ejecución mientras se ejecutaba el código de evaluación.

source: This might be either an error in the grading code (i.e. calling non existent variable or function) or student code (i.e. the function to be tested is not present in the notebook).
es: Esto puede ser un error en el código de evaluación (por ejemplo al llamar una función o variable que no existe) o en el código del estudiante (por ejemplo que la función a ser probada no está en el código del estudiante).

source: If you get this message, do not worry, There's Nothing Wrong With Your Code!
es: Si obtienes este mensaje, no te preocupes, ¡tu código no está mal!

source: This error means UNCode had a problem while running or assessing your code. So, <b>the problem is on our side.</b>
es: Este error indica que UNCode tuvo un problema al ejecutar el código. Por ende, <b>el problema se aloja en nuestro lado.</b>

source: We apologise in advance. Please reload the page and try submitting again! If you still get the same result, please wait a while and try again or contact your professor.
es: Nos disculpamos por esto. ¡Recarga la página e intenta enviarlo de nuevo! Si el error persiste, por favor espera un tiempo y vuelve a intentarlo, o contacta con tu profesor.

source: This might be also caused by a too small time limit in the task configuration (talk to your professor about it).
es: Esto también puede ser ocasionado por un tiempo límite muy pequeño al configurar la tarea (habla con tu profesor al respecto).

source: Your code is printing too much data, possibly caused by prints in an infinite loop.
es: Tu código tiene una salida muy grande, probablemente causado por imprimir en ciclos infinitos.

source: "<li><a href='/analytics/' class='navbar-link'> <i class='fa fa-bar-chart fa-fw'></i> Analytics</a></li>
es: "<li><a href='/analytics/' class='navbar-link'> <i class='fa fa-bar-chart fa-fw'></i> Analítica</a></li>

source: The start date must be greater than end date.
es: La fecha inicial debe ser mayor que la fecha final.

source: Invalid date format
es: El formato de fecha es inválido.

source: Username
es: Nombre de usuario

source: Course
es: Curso

source: "All courses"
es: Mis cursos

source: Download CSV
es: Descargar CSV

source: Heat map
es: Mapa de calor

source: Visits per day
es: Visitas por día

source: Box plot
es: Diagrama de cajas

source: Radar plot
es: Diagrama de radar

source: Analytics per course
es: Analíticas por curso

source: Course deleted
es: Curso borrado

source: Password
es: Contraseña

source: Sign in
es: Iniciar sesión

source: Code template
es: Plantilla de código

source: Remove
es: Eliminar

source: Select one language
es: Seleccione un lenguaje

source: Languages
es: Lenguajes

source: Add/Update
es: Agregar/Actualizar

source: Contact us
es: Contáctanos

source: Contact Page
es: Página de contacto

source: Correct all the errors noted in order to send the message
es: Corriga los errores señalados para poder enviar el mensaje

source: Subject
es: Asunto

source: Select an option
es: Selecciona una opción

source: Report a problem or make a comment
es: Reportar un problema o hacer un comentario

source: Request to create a new course
es: Solicitud para crear un curso

source: The email field is required
es: El email es obligatorio

source: An email is requested
es: Es necesario un correo electrónico válido

source: Name
es: Nombre

source: The name field is required
es: El nombre es obligatorio

source: Edit
es: Editar

source: Course Name
es: Nombre del curso

source: Group
es: Grupo

source: Comments or description
es: Comentarios o descripción

source: Put your opinion or tell us about the problem you have encountered
es: Danos su opinión o escríbenos sobre un problema que hayas encontrado

source: Describe and justify the course you want to create
es: Describe y justifica el curso que deseas crear

source: The comment is too short
es: El comentario es demasiado corto.

source: Send
es: Enviar

source: Message Status
es: Estado del mensaje

source: The message has been sent
es: El mensaje fue enviado correctamente.

source: The message could not be sent
es: El mensaje no fue enviado correctamente.

source: More Details
es: Detalles

source: Create course
es: Crear curso

source: The course name cannot be empty.
es: El nombre del curso no puede estar vacío.

source: The year field cannot be empty.
es: El campo año no puede estar vacío.

source: The year must be a number.
es: El año debe der un número.

source: The period field cannot be empty.
es: El campo periodo no puede estar vacío.

source: The selected course to copy tasks from does not exist.
es: El curso del que se copiarán las tareas no existe.

source: An internal error occurred while copying tasks.
es: Un error interno ocurrió mientras las tareas eran copiadas.

source: The course was successfully created.
es: El curso fue creado satisfactoriamente.

source: The text may contain an invalid character. Only alphanumeric characters, in addition to '_' and '-' are accepted.
es: El texto puede contener un carácter inválido. Solamente caracteres alfanuméricos, junto con '_' y '-' son aceptados.

source: A course with the id {} already exists.
es: Un curso con el id {} ya existe.

source: An error occurred while creating the course
es: Un error ocurrió mientras el curso era creado.

source: Course name
es: Nombre del curso

source: Year
es: Año

source: Copy tasks from
es: Copiar tareas de

source: Select a course to copy tasks
es: El curso del que se copiarán las tareas no existe.

source: Cannot set a 'Code Multiple Languages' or 'Code File Multiple Languages' problem with a 'Notebook' grading environment
es: Calificador: No se puede crear un subproblema de tipo 'Code Multiple Language' o 'Code File Multiple Language' con un calificador 'Notebook'.

source: Cannot set a 'Notebook' problem in a non 'Notebook' grading environment
es: Calificador: Solo se puede crear un subproblema de tipo 'Notebook' para un calificador de 'Notebook'

source: Grader
es: Calificador

source: 'Maximum diff lines' must be an integer
es: 'Número máximo de líneas de diferencia' debe ser entero

source: 'Diff context lines' must be an integer
es: 'Líneas de diferencia de contexto' debe ser un entero

source: Grader: the problem was not specified
es: Calificador: el problema no fue especificado

source: Grader: problem does not exist
es: Calificador: el problema no existe

source: Grader: only 'Code Multiple Language', 'Code File Multiple Language' and 'Notebook' problems are supported
es: Calificador: Solo 'Code Multiple Language', 'Code File Multiple Language' y 'Notebook' son soportados.

source: 'Maximum diff lines' must be positive
es: 'Número máximo de líneas de diferencia' debe ser positivo.

source: 'Diff context lines' must be positive
es: 'Líneas de diferencia de contexto' debe ser positivo

source: No testbench was selected for testing
es: Ningún testbench fué seleccionado.

source: No expected output was selected for testing
es: Ninguna salida esperada fue seleccionada.

source: The weight for grader test cases must be a float
es: El peso para los casos de prueba deber ser un número decimal.

source: Invalid input file in grader test case
es: Archivo de entrada inválido para el caso de prueba

source: Invalid output file in grader test case
es: Archivo de salida inválido para el caso de prueba

source: Grader input file does not exist:
es: El archivo de entrada no existe:

source: Grader output file does not exist:
es: El archivo de salida no existe:

source: You must provide test cases to generate the grader
es: Debe proveer casos de prueba para generar el calificador.

source: Duplicated input files in grader
es: Archivos de entrada están duplicados.

source: The sum of all weights must be grater than zero
es: La suma de todos los pesos debe ser mayor a cero.

source: Grader: Memory limit exceeds the maximum allowed (500 MBs).
es: Calificador: Límite de memoria excede el máximo permitido (500 MBs).

source: Grader: Time limit exceeds the maximum allowed (30 s).
es: Calificador: Límite de tiempo excede el máximo permitido (30 s).

source: Grader: Output limit exceeds the maximum allowed (30 MBs).
es: Calificador: Límite de salida estándar excede el máximo permitido (30 MBs).

source: The name for grader tests must be a string
es: El nombre de la prueba debe ser texto.

source: The setup code for grader tests must be a string
es: El código de configuración debe ser texto.

source: You must provide tests to autogenerate the grader
es: Debe proveer pruebas para auto generar el calificador.

source: Grader: Syntax error in setup code for all tests
es: Calificador: Error de sintaxis el código de configuración de todas las pruebas.

source: Grader: Dataset url is not a valid URL.
es: Calificador: URL del dataset no es válida.

source: Grader: To download a dataset, you must also set the dataset filename.
es: Calificador: Para descargar el dataset, debe proveer un nombre de archivo.

source: Grader: Dataset filename is not a valid name.
es: Calificador: El nombre del dataset no es válido.

source: Grader: To download a dataset, you must also set the dataset URL.
es: Calificador: Para descargar un dataset, también debe proveer la URL.

source: Grader: Time limit for test cases must be positive and integer.
es: Calificador: El límite de tiempo de los casos de prueba debe ser entero positivo.

source: Grader: Time limit exceeds the maximum allowed (30 s.).
es: Calificador: El tiempo límite excede el máximo permitido (30 s.).

source: Grader: Memory limit for test cases must be positive and integer
es: Calificador: El límite de memoria para los casos de prueba debe der un entero positivo.

source: Grader: Memory limit exceeds the maximum allowed (600 MBs).
es: Calificador: El límite de memoria excede el máximo permitido (600 MBs).

source: Grader: Syntax error in setup code of '%s' test
es: Calificador: Error de sintaxis en el código de configuración del test '%s'

source: Grader: The weight must be a positive number
es: Calificador: El peso debe ser un número positivo.

source: Grader: You must provide test cases for test '%s' to generate the grader
es: Calificador: Debe proveer casos de prueba para el test '%s'

source: Grader: Syntax error in code on test '%s', case %s
es: Calificador: Error de sintaxis en el código de la prueba '%s', caso '%s'

source: Generate grader automatically
es: Generar calificador automáticamente

source: Problem ID
es: ID del problema

source: "Problem id where the code is located"
es: "Id del Problema"

source: Maximum diff lines
es: Número máximo de líneas de diferencia

source: Diff context lines
es: Líneas de diferencia de contexto

source: Show runtime errors
es: Mostrar errores en tiempo de ejecución

source: "In case it is not checked, the student's result is either ACCEPTED or WRONG_ANSWER. If checked, it shows additional errors like RUNTIME_ERROR or TIME_LIMIT_EXCEEDED."
es: "En caso de que no esté chequeado, los resultados del estudiante son solo ACCEPTED o WRONG_ANSWER. Si está chequeado, se muestran errores adicionales cómo RUNTIME_ERROR o TIME_LIMIT_EXCEEDED."

source: Ignore Presentation error
es: Ignorar Error de presentación

source: "In case it is checked, the presentation errors will be ignored when grading the student's submission"
es: "En caso de que esté seleccionado, los errores de presentación serán ignorados cuando se evalúan los envíos de los estudiantes."

source: Time limit test cases (s)
es: Tiempo límite casos de prueba (s)

source: "Time limit for each test case in seconds. (Max. 30s)"
es: "Tiempo límite para cada caso de prueba en segundos. (Max. 30s)"

source: Memory limit test cases (MB)
es: Límite de memoria para casos de prueba (MB)

source: "Memory limit for each test case in MBs. (Max. 500 MBs)"
es: "Límite de memoria para cada caso de prueba en MB. (Max. 500 MB)"

source: Output limit test cases (MB)
es: Límite de salida estándar de casos de prueba (MB)

source: "Output limit for each test case in MBs. (Max. 30 MBs)"
es: "Límite de salida para cada caso de prueba en MBs. (Máx. 30 MBs)"

source: Test cases
es: Casos de prueba

source: Remove all tests
es: Eliminar todas las pruebas

source: Input file
es: Archivo de entrada

source: Output file
es: Archivo de salida

source: Weight
es: Peso

source: Show differences
es: Mostrar diferencias

source: "Custom feedback to show to the students"
es: "Retroalimentación personalizada a mostrar a los estudiantes"

source: Custom feedback
es: Retroalimentación personalizada

source: Options
es: Opciones

source: Add
es: Agregar

source: Entity (only on VHDL)
es: Entidad (solo en VHDL)

source: "Time limit for each test case in seconds. (Max. 30 s)"
es: "Límite de tiempo para cada caso de prueba en segundos. (Max. 30 s)"

source: "Memory limit for each test case in MBs. (Max 600 MBs)"
es: "Límite de memoria para cada caso de prueba en MB. (Max. 600 MB)"

source: Setup code for all tests
es: Código de configuración de todas las pruebas.

source: Add a test
es: Agregar prueba

source: Show debug info
es: Mostrar más información

source: "Check to show more info the student like output difference and runtime errors"
es: "Chequear para mostrar más información al estudiante como diferencia en la salida o errores en tiempo de ejecución."

source: Save
es: Guardar

source: Test name
es: Nombre del test

source: Setup code
es: Código predeterminado

source: Case code
es: Código del caso

source: Case expected output
es: Salida esperada caso

source: Code
es: Código fuente

source: Expected output
es: Salida esperada

source: The course does not exist.
es: El curso no existe.

source: User cannot be registered. Some user data is no provided.
es: No se puede registrar al usuario. Falta proporcionar información del usuario.

source: An error occurred while registering the user.
es: Un error ocurrió mientras se registraba al usuario.

source: Your UNCode account was successfully created!. An email was sent to you with your account credentials.
es: ¡Tu cuenta de UNCode fue creada exitosamente!. Un correo electrónico con tus credenciales te ha sido enviado para activar tu cuenta.

source: The new user was not created. There was an error sending the email.
es: No se pudo crear el nuevo usuario. Ocurrió un error al enviar el correo electrónico.

source: The new user was not created. Maybe the username or email were already taken.
es: No se pudo crear el nuevo usuario. Es posible que el nombre de usuario o el correo electrónico ya se estén utilizando.

source: An error occurred while registering the user in the course.
es: Un error ha ocurrido al registrar al usuario al curso.

source: Your user was registered in the course. Please check the email that was sent to you with the information of the course you have been enrolled to.
es: Has sido registrado al curso. Por favor revisa el correo que fue enviado con la información del curso.

source: You have been enrolled on a course
es: Has sido inscrito en un curso

source: There was an error sending the course registration email.
es: Un error ha ocurrido mientras se enviaba el correo electrónico del registro.

source: You were not registered in the course. Your are already registered in the course, you have no permissions or there is no a created user with the provided data
es: No fuiste registrado al curso. Ya te encuentras registrado al curso, no tienes permisos para ingresar, o no existe un usuario registrado con los datos proporcionados.

source: LTI Registration
es: Registro por LTI

source: Create a new account
es: Crear una nueva cuenta en UNCode

source: You are already logged in with an existing UNCode account, close this window and try with "Bind your account" option.
es: Ya ha iniciado sesión con una cuenta UNCode existente, cierre esta ventana e intente con la opción "Enlaza tu cuenta de UNCode"

source: The following operations were successful when registering the user:
es: Ocurrieron algunos errores mientras se registraba el usuario.

source: Some errors occurred while registering the user:
es: Ocurrieron algunos errores mientras se registraba el usuario.

source: Your new user account data
es: Los datos de la nueva cuenta son

source: You are going to create a new user account on the UNCode platform. The following user data is used to create your account:
es: Una nueva cuenta será creada en UNCode. Los siguientes datos serán utilizados para crear la cuenta:

source: Your complate name:
es: Nombre completo:

source: Your username:
es: Tu nombre de usuario:

source: Your email:
es: Tu correo:

source: Do you want to create your user account with these data?. An email will be sent to you with the credentials of your UNCode account and the activation steps.
es: ¿Quieres crear una nueva cuenta con estos datos?. Se enviará un correo con las credenciales de tu cuenta y los pasos de activación.

source: Once you have activated your UNCode account, go back to the task page in the course and click the <strong>"Bind your UNCode account"</strong> link to use UNCode.
es: Una vez que tu cuenta esté activa, dirígete a la tarea y enlaza tu cuenta de UNCode.
