Repository: JuezUN/INGInious
Catalog: inginious/frontend/i18n/*/LC_MESSAGES/messages.po
Languages: es

source: If you change the grading environment task subproblem will be deleted!
es: Si cambia entorno de calificación de la tarea, el subproblema se eliminará!

source: Upload a file
es: Subir archivo

source: File:
es: Archivo:

source: File path:
es: Ruta de archivos

source: Upload
es: Subir archivo

source: Path
es: Ruta

source: Move
es: Mover

source: Delete
es: Eliminar

source: "Download"
es: "Descargar"

source: "Delete"
es: "Eliminar"

source: Create a new file
es: Crear un nuevo archivo

source: Problem type
es: Tipo de subproblema

source: Tag editor
es: Editor de etiquetas

source: Import tags
es: Importar etiquetas

source: Tags without a name will be automatically removed.
es: Etiquetas sin nombre serán eliminadas automáticamente al guardar.

source: Description
es: Descripción

source: Show to students
es: Mostrar a los estudiantes

source: Type
es: Tipo

source: Misconception
es: Confusión

source: New tag
es: Nueva etiqueta

source: Import
es: Importar

source: Tasks to download submissions from
es: Tareas desde dónde descargar submissions

source: Tasks to replay submissions from
es: Tareas de donde reenviar submissions

source: Deselect all
es: Desmarcar todo

source: Select students
es: Seleccionar estudiantes

source: Select classrooms
es: Seleccionar classrooms

source: Select teams
es: Seleccionar equipos

source: Default value
es: Valor predeterminado

source: Allowed file extensions (including the dot, separated by spaces)
es: Extensiones de archivo permitidas (incluyendo el punto, separado por espacios)

source: Answer
es: Respuesta

source: Can select multiple answers
es: Puede seleccionar multiples respuestas

source: Count error only at top of the page?
es: Contar error solamente en la parte superior de la página?

source: Number of choices to display (0 = all choices)
es: Número de opciones a mostrar (0 = todas las opciones)

source: Success message
es: Mensaje de correcto

source: Error message
es: Mensaje de error

source: Choices
es: Opciones

source: Content
es: Contenido

source: Feedback message (displayed when selected)
es: Mensaje de retroalimentación (mostrado al seleccionar)

source: Valid ?
es: ¿Validar?

source: "Refresh fields"
es: "Recargar campos"

source: "Revoke access"
es: "Revocar acceso

source: Identifier:
es: Identificador:

source: Add a new binding
es: Agregar nuevo enlace de autenticación

source: Select a authentication binding
es: Seleccionar un enlace de autenticación

source: Add new binding
es: Agregar nuevo enlace

source: Please set a new username
es: Escriba el nombre de usuario

source: Username :
es: Nombre de usuario :

source: Language :
es: Lenguaje :

source: Old password :
es: Anterior contraseña :

source: New password (min. 6 characters) :
es: Nueva contraseña (6 caracteres mín.)

source: Confirm new password :
es: Confirmar nueva contraseña

source: Save my profile
es: Guardar perfil

source: Click here to download the file you submitted previously
es: Clic aquí para descargar el archivo enviado anteriormente

source: Allowed extensions:
es: Extensiones permitidas
