Repository: JuezUN/INGInious
Catalog: inginious/frontend/i18n/*/LC_MESSAGES/messages.po
Languages: es

source: Group #
es: Grupo #

source: No set group in this classroom. If you think this is a mistake, please contact the course administrator.
es: No hay ningún grupo en este curso. Si se trata de un error, contacta al administrador del curso.

source: You're not registered to a group. Please consider registration in one of the group below to take part in all course activities. If no more group is available, please contact the course administrator.
es: Usted no esta registrado a este grupo. Intente registrarse a este grupo como se indica a continuación para seguir las actividades de los cursos. Si ningún grupo está disponible, contacte al administrador del curso.

source: You're not yet registered to a group. Please contact the course administrator for more information.
es: Usted no esta registrado a este grupo. Contacte al administrador del curso para mas información.

source: All groups
es: Todos los grupos

source: No registered member.
es: No es un miembro registrado.

source: Current grade
es: Calificación actual

source: Course administration
es: Administración de curso

source: Classroom :
es: Salón :

source: Team :
es: Equipo :

source: Teams management
es: Gestión de equipos

source: "My courses"
es: "Mis cursos"

source: "Course list"
es: "Lista de cursos"

source: No filter
es: Sin filtro

source: Error 403
es: Error número 403

source: You are not registered to this course.
es: El usuario no está registrado a este curso.

source: Course list
es: Lista de cursos

source: Public courses
es: Cursos públicos

source: This page lists all the courses that are available now. If you are a course administrator, go to your 'My courses' page to see all of them.
es: Esta página muestra la lista de cursos disponibles. Si eres administrador de un curso, selecciona la página “Mis cursos” para obtener la lista completa de cursos.

source: My courses / Register for a course
es: Registrarse a un curso

source: 'Auto-registration'
es: Registro por LTI

source: 'Password needed'
es: 'Contraseña requerida'

source: You are trying to enter to a LTI course. LTI courses are only accessible via the LMS platforms such as Moodle or OpenEdx
es: Está intentando ingresar a un curso LTI. Solo se puede acceder a los cursos LTI a través de las plataformas LMS como Moodle u OpenEdx

source: My courses
es: Mis cursos

source: Preferences
es: Preferencias

source: Log out
es: Cerrar sesión

source: Register
es: Registrarse

source: UNCode is distributed under AGPL license
es: UNCode sigue la especificación de la licencia AGPL

source: Visit the <a href="https://juezun.github.io" target="_blank">UNCode Web Page</a> for more information and documentation.
es: Visite la <a href="https://juezun.github.io" target="_blank">Página Web de UNCode</a> para más información y documentación.

source: Bind LTI
es: Enlace LTI

source: Binding to an existing LMS
es: Enlazado con una dependencia LMS

source: Authorization required
es: Se requiere autorización

source: You are going to bind your UNCode account
es: Vas a vincular tu cuenta UNCode

source: with the following LTI tool and context:
es: con el siguiente servicio y contexto LTI:

source: Tool name:
es: Nombre del servicio:

source: Tool description:
es: Descripción del servicio:

source: Tool URL:
es: URL del servicio:

source: Tool context:
es: Contexto del servicio:

source: Tool identifiers:
es: Identificadores del servicio:

source: Bind my account
es: Crea enlace con mi cuenta

source: Login
es: Conectarse

source: Hello!
es: Hola!

source: Welcome on the UNCode platform.
es: Estás ingresando a UNCode.

source: In order to use UNCode via this platform, please bind your existing account or create a new one.
es: Para usar UNCode a través de esta plataforma, por favor vincule su cuenta existente o cree una nueva.

source: Invalid login/password
es: Nombre de usuario o contraseña inválidos

source: If you don't have a UNCode account yet, you can create a new one with your existing account in this platform or you can create a different account via UNCode.
es: Si aún no tiene una cuenta UNCode, puede crear una nueva con la información de su cuenta existente en esta plataforma o puede crear una cuenta diferente a través de UNCode.

source: Create a UNCode account via this platform
es: Cree una cuenta UNCode a través de esta plataforma

source: If you already have an account, please bind your account to this platform.
es: Si ya tiene una cuenta, por favor vincule su cuenta a esta plataforma.

source: Bind your UNCode account
es: Enlaza tu cuenta de UNCode

source: Refresh
es: Actualizar la página

source: Maintenance
es: Mantenimiento

source: Course created.
es: Curso creado.

source: Failed to create the course. It might either already exist or contain an invalid character (only alphanumeric in addition to '_' and '-' are accepted).
es: Error al crear curso. Puede ya existir o contener un caracter inválido (solo son aceptados alfanuméricos, junto con '_' y '-' son aceptados).

source: Register for a course
es: Registrarse a un curso

source: Registration complete.
es: Registro completo.

source: Registration failed. Please check that you properly typed the password.
es: El nuevo registro ha fallado. Verifique su contraseña.

source: Select a course
es: Seleccione un curso

source: 'Search course'
es: 'Buscar curso'

source: LTI course
es: Curso LTI

source: Hidden course
es: Curso oculto

source: Administrator
es: Administrador

source: Tutor
es: Tutores

source: You are not registered to any course
es: Usted no está registrado en ningún curso.

source: Error 404
es: Error número 404

source: Job queue
es: Tarea en lista de espera

source: This page shows a <strong>snapshot</strong> of the job queue.
es: Esta página muestra un <strong>respaldo</strong> de las tareas en la lista de espera.

source: Running jobs
es: Ejecutando tareas

source: Local client
es: Cliente local

source: Agent name
es: Nombre del test

source: Started at
es: Empezó el

source: Yes
es: Si

source: Jobs in queue
es: Tareas en lista de espera

source: Register in UNCode
es: Crear un registro en UNCode

source: Complete name :
es: Nombre completo:

source: Email address :
es: Correo electrónico:

source: Password (min. 6 characters) :
es: Contraseña (al menos escriba 6 caracteres):

source: Confirm password :
es: Confirme su contraseña:

source: Sign up
es: Registrarse

source: Lost password ?
es: ¿Ha olvidado su contraseña?

source: Reset my password
es: Cambiar su contraseña

source: Set new password
es: Poner nueva contraseña

source: Enroll in the course
es: Regístrate al curso

source: Please enroll in the course to be able to submit answers to problems.
es: Inscríbase en el curso para poder enviar respuestas a los problemas.

source: This will enroll you in the course
es: Esto te inscribirá en el curso

source: Please register or sign in to see the complete list of courses and be able to submit answers to problems.
es: Por favor, regístrese o inicie sesión para ver la lista completa de cursos y poder enviar respuestas a los problemas.

source: Author(s)
es: Autores

source: Deadline
es: Fecha de entrega

source: Not yet attempted
es: La tarea no se ha intentado

source: Succeeded
es: Tarea completada con éxito

source: Waiting for verification
es: Esperando la verificación

source: Failed
es: La tarea ha fallado

source: Grading weight
es: Promedio ponderado

source: Attempts
es: Intentos

source: Submission limit
es: Tiempo límite de envío

source: No limitation
es: Sin Límite

source: submissions<br /> every
es: envíos<br /> cada

source: hour(s)
es: hora(s)

source: submissions
es: envíos

source: Tags
es: Etiquetas

source: Administration
es: Administración

source: Edit task
es: "Editar tarea"

source: Debug information
es: Información de depuración

source: Team
es: Mi equipo

source: For evaluation
es: Evaluación

source: Last submission
es: Último envío

source: Best submission
es: Mejor envío

source: Selected submission
es: Ver envío

source: No submission
es: No hay tareas enviadas

source: Submission history
es: Historial de tareas enviadas

source: "Previous task"
es: "Tarea previa"

source: "Next task"
es: "Siguiente tarea"

source: Please answer to all the questions.
es: Responda a todas las preguntas.

source: Question
es: Pregunta

source: Please enroll in the course to submit.
es: Regístrate al curso para hacer envíos.

source: Submit
es: Enviar

source: The deadline is over, you cannot submit anymore
es: La fecha límite ha sido alcanzada, no puede hacer más envíos

source: Please register in a group
es: Usted no está registrado en ningún grupo.

source: You have reached the submission limit.
es: Límite de envío de tareas alcanzado.

source: You are not allowed to submit
es: Usted no está autorizado para realizar envíos.

source: Task unavailable
es: La tarea no esta disponible

source: Register for a group
es: Registrarse a un grupo

source: My team :
es: Mi equipo es:

source: No set team in this course. If you think this is a mistake, please contact the course administrator.
es: No hay ningún equipo en este curso. Si se trata de un error, contacta al administrador del curso.

source: My team
es: Mi equipo

source: You're not registered to a team. Please consider registration in one of the team below to take part in all course activities. If no more team is available, please contact the course administrator.
es: Usted no esta registrado a este grupo. Intente registrarse a este grupo como se indica a continuación para seguir las actividades de los cursos. Si ningún grupo está disponible, contacte al administrador del curso.

source: You're not yet registered to a team. Please contact the course administrator for more information.
es: Usted no está registrado a este grupo. Contacte al administrador del curso para más información.

source: All teams
es: Todos los equipos

source: (available: )
es: (disponible: )

source: Unregister from
es: Elimine su registro de

source: This will keep your submissions saved but will remove you from your classroom/teams.
es: Está acción almacenará sus tareas pero será eliminado de sus grupos o equipos.

source: Are you sure ?
es: ̉¿Estás seguro?

source: Unregister
es: Dar de baja

source: Unregister from this course
es: Dar de baja de este curso

source: 'Administration'
es: 'Administración'

source: "Classrooms"
es: Grupos

source: "Teams"
es: "Equipos"

source: Statistics for classroom
es: Estadísticas para el aula

source: Statistics for group
es: Estadísticas para el grupo

source: # submissions
es: Número de tareas enviadas

source: "Download all submissions"
es: "Descargar todas las tareas"

source: "Replay all submissions"
es: "Repetir todos los envíos"

source: Not viewed
es: No visto

source: Not attempted (viewed)
es: La tarea no se ha intentado

source: "View submissions"
es: Ver envíos

source: "Download submissions"
es: "Descargar las tareas enviadas"

source: "Replay submissions"
es: "Repetir envíos"

source: Edit teams
es: Editar los equipos

source: Upload structure
es: Subir estructura

source: Upload course structure
es: Subir estructura de curso

source: Classroom
es: Aula

source: # students
es: # Estudiantes

source: # task tried
es: Número de tareas que has intentado

source: # task done
es: Número de tareas que has intentado

source: "Download CSV"
es: "Descargar el archivo CSV"

source: My classroom(s)
es: Mi(s) Aula(s)

source: Other classroom(s)
es: Seleccionar aula(s)

source: My team(s)
es: Mi equipo

source: Other team(s)
es: Otros equipos

source: "Edit classroom"
es: "Editar classrooms"

source: Default classroom :
es: El grupo inicial (creado por defecto):

source: New classroom description
es: Descripción del grupo

source: New classroom
es: Nueva aula

source: Edit classroom
es: Editar aula

source: Add student
es: Agregar estudiante

source: Registered student
es: Estudiantes inscritos

source: New student
es: Agregar estudiante

source: Choose student :
es: Seleccionar estudiante:

source: Student username (will be registered) :
es: Estudiante (a registrar):

source: "Student username"
es: Estudiante

source: Basic settings
es: Configuración básica

source: Classroom description
es: Descripción del aula

source: Delete classroom
es: Eliminar aula

source: Tutor list
es: Lista de tutores

source: Add tutor
es: Añadir tutor

source: Max group size :
es: Tamaño máximo de grupos:

source: New group
es: Nuevo grupo

source: Clean groups
es: Limpiar grupos

source: Delete all groups
es: Suprimir todos los grupos

source: Archive data
es: Archivar los datos

source: Delete course
es: Suprimir el curso

source: Archive course data
es: Archivar los datos del curso

source: <p>This will reset and backup all course data (submissions, classrooms/teams, user statistics, among others) from the database.</p><p>To confirm your will, please type the course id below:</p>
es: <p>Esta acción reinicializará y hará un respaldo de la información de todo el curso (tareas enviadas, grupos, equipos, estadísticas de usuarios, entre otros) de esta base de datos.</p><p>Para confirmar, escriba el identificador del curso:</p>

source: "course id"
es: "id del curso"

source: Restore backup from
es: Restaurar copia de respaldo de

source: <p>This will restore your course data to
es: <p>Esta acción restaurará la información del curso a

source: . Are you sure ?</p>
es: ̉. ¿Está seguro?</p>

source: Restore backup
es: Restaurar copia de respaldo

source: Backups
es: Copias de respaldo

source: backup date
es: Fecha de la copia de respaldo

source: download
es: Descargar

source: "Download backup"
es: "Descargar copia de respaldo"

source: <p> This will <b>permanently</b> remove the course and all its data (including tasks and backups) from UNCode.</p><p>To confirm your will, please type the course id below :</p>
es: <p>Esta acción <b>eliminará permanentemente</b> el curso y toda su información (incluyendo las tareas y los respaldos) de UNCode. Para confirmar, por favor escriba el identificador del curso :</p>

source: <p>This will <b>permanently</b> remove the course and all its data (including tasks and backups) from UNCode. Are you really sure ?</p>
es: <p>Esta acción <b>eliminará permanentemente</b> el curso y toda su información (incluyendo las tareas y los respaldos) de UNCode. ¿Esta seguro de realizar esta acción?</p>

source: Folder format
es: Formato de carpeta

source: aggregation
es: id de la tarea/agregación

source: classroom
es: Grupos

source: team
es: Mi equipo

source: Download only the evaluation submission for each task/user
es: Descarga solamente las evaluaciones de los envíos por cada tarea/usuario

source: Download all the submissions
es: "Descargar todas los envíos"

source: How to create a task?
es: ¿Como crear una tarea?

source: Documentation
es: Documentación

source: Replay
es: Repetir

source: Only the evaluation submission (Warning: the best submission may change)
es: Únicamente el envío calificador (Aviso: el mejor envío puede cambiar)

source: All the submissions
es: Todos los envíos

source: Settings
es: Opciones

source: Settings saved.
es: Guardar configuración.

source: "Course name"
es: Nombre del curso

source: Administrators
es: Administradores

source: "Usernames of the administrators, separated by commas"
es: Nombres de usuario de los administradores, separados por comas

source: "Usernames of the tutors, separated by commas"
es: Nombres de usuario de los tutores, separados por comas

source: Enable LTI
es: Habilitar LTI

source: Enable this option to allow your UNCode course to be used in external Learning Management Systems (LMS) such as Moodle or edX. Note that this will deactivate the access to the course from the main page for non-staff members of the course, and the team/classroom system.
es: Habilite esta opción para permitir que su curso UNCode se use en Sistemas de gestión de aprendizaje (LMS) como Moodle o edX. Tenga en cuenta que esto desactivará el acceso al curso desde la página principal para los miembros no administrativosdel curso, y el sistema de grupos/aulas

source: Course preview
es: "id del curso"

source: Students aggregations
es: Agregaciones del estudiante

source: Staff and students
es: Estudiantes inscritos

source: Use Linter in tasks automatically
es: Usar Linter en las tareas automáticamente

source: Accessibility
es: Accesibilidad

source: Custom:
es: Personalizado:

source: From
es: Desde

source: To
es: Hasta

source: Registration
es: Registro

source: Closed
es: Cerrado

source: Always open
es: Siempre abierto

source: Allow auto-unregistration
es: Permitir "darse de baja" automaticamente

source: Registration password
es: Contraseña de registro

source: Access control
es: Control de acceso

source: No access control (everyone can register)
es: Sin control de acceso (acceso público)

source: Check by username
es: Verificar por nombre de usuario

source: Check by authentication binding
es: Verificar mediante enlace de autenticación

source: Check by email
es: Verificar con correo electrónico

source: Access control list
es: Lista de control de acceso

source: "Only used if access control is activated. Separate users by new lines."
es: "Esta acción se permite solo si se activa el control de acceso. Por favor, escriba un solo nombre de usuario por línea."

source: "LTI keys in the form name:key, separated by newlines. Please ensure keys are long enough and random."
es: "Las llaves LTI tienen el formato nombre:llave y están separadas por nuevas líneas. Asegúrese que las llaves tienen caracteres aleatorios y que el número de caracteres es relativamente grande."

source: Enable this to send back grades to the calling Tool Consumer (which is, most of the time, your LMS).
es: Enviar las notas al Tool Consumer (el cuál es la mayoría del tiempo el LMS).

source: Save changes
es: Guardar cambios

source: "Students"
es: "Estudiantes"

source: Statistics for student
es: Estadísticas del estudiante

source: task
es: Tarea

source: status
es: estado

source: "View evaluation submission"
es: "Ver resultado del envío"

source: "View all submissions"
es: "Ver todos los envíos"

source: Registered staff
es: Personal registrado

source: Registered students
es: Estudiantes inscritos

source: member
es: miembro

source: student
es: Estudiante

source: current grade
es: calificación actual

source: "Download all submissions"
es: "Descargar todos los envíos"

source: "Unregister"
es: "Dar de baja"

source: This will remove
es: Esta acción removerá a

source: from the course. Are you sure ?
es: del curso. ¿Está seguro?

source: Remove
es: Eliminar

source: Submission
es: Envío

source: Download full submission
es: Descargar envío completo

source: Replay submission
es: Renviar envío

source: Replay as
es: Repetir como

source: Replay/debug as
es: Repetir/depurar como

source: "Download as file"
es: Descargar como archivo

source: Submissions for task "{0}" - {1} ({2})
es: Envíos para la tarea "{0}" - {1} ({2})

source: Submissions for the task "{0}" - {1}
es: Envíos para la tarea "{0}" - {1}

source: Query submissions
es: Consultar envíos

source: Users
es: Usuarios

source: Only evaluation submissions
es: Solamente submissions de evaluación

source: Show submission id
es: Mostrar id de la submission

source: Show task name
es: Mostrar nombre de la tarea

source: Show student name
es: Mostrar nombre del estudiante

source: Min grade
es: Nota mínima

source: Max grade
es: Máxima Calificación

source: After date
es: Fecha después

source: Before date
es: Fecha antes

source: Sort by
es: Organizado por

source: Order
es: Orden

source: Descending
es: Descendente

source: Ascending
es: Ascendente

source: Limit
es: Límite

source: No statistics
es: Sin estadísticas

source: With statistics
es: Con estadísticas

source: Download format
es: descargar

source: Submissions statistics
es: Estadísticas del curso

source: student name
es: Mostrar nombre del estudiante

source: username
es: Nombre de usuario

source: task name
es: Mostrar nombre de la tarea

source: taskid
es: id de la Tarea

source: submitted on
es: Envío realizado el

source: result
es: resultados

source: "View submission"
es: Ver tareas

source: "Download submission"
es: "Descargar las tareas enviadas"

source: "Replay submission"
es: "Reenviar a las tareas enviadas"

source: Edit
es: Editar

source: "Tasks"
es: "Tareas"

source: Edit task
es: Editar tarea

source: View task
es: Ver tarea

source: Container setup
es: Configuración del contenedor

source: Subproblems
es: Subproblemas

source: Task files
es: Archivos de la tarea

source: File list
es: Lista de archivos

source: Delete task
es: Borrar tarea

source: This will <b>permanently</b> remove the task and its files from UNCode.
es: <p>Esta acción <b>eliminará permanentemente</b> el curso y toda su información (incluyendo las tareas y los respaldos) de UNCode. ¿Esta seguro de realizar esta acción?</p>

source: Problem id:
es: ID del problema

source: Results for task
es: Resultados para tarea

source: Individual results
es: Resultados individuales

source: Team results
es: Resultados del equipo

source: "Download submissions"
es: "Descargar las tareas enviadas"

source: Update task order
es: Actualizar orden de tareas

source: # student viewed
es: # estudiantes vieron

source: # student attempted
es: # estudiantes intentaron

source: # student succeeded
es: # estudiantes correcto

source: "Edit task"
es: "Editar tarea"

source: "View results"
es: "Ver resultados"

source: "New task id"
es: "ID de la tarea nueva"

source: Create new task
es: Crear una nueva tarea

source: Errors while loading tasks
es: Un error interno ocurrió mientras las tareas eran copiadas.

source: task id
es: id de la Tarea

source: Non teamed students
es: Estudiantes sin equipo

source: "Delete team"
es: "Eliminar equipo"

source: New team
es: Nuevo equipo

source: Clean teams
es: Todos los equipos

source: Delete all teams
es: Borrar todos los equipos

source: File type
es: Tipo de archivo

source: Author
es: Autor

source: "Your name"
es: "Tu nombre"

source: LTI task URL
es: URL tarea LTI

source: Submission mode
es: Modo de envío

source: Individually
es: Individualmente

source: Per group/team
es: Por grupo/equipo

source: Submission storage
es: Almacenamiento de envíos

source: All submissions
es: Todas las tareas enviadas

source: Only the last
es: Solamente

source: submissions
es: envios de evaluación

source: Submission limits
es: Límites de envío

source: Hard limit:
es: Limite fijo:

source: submission(s)
es: envío(s)

source: Soft limit:
es: Limite suave:

source: submission(s) every
es: envío(s) cada

source: Evaluation submission
es: Envío calificador

source: Student choice
es: Elección del estudiante

source: Allow late submission
es: Permitir envío posterior

source: "If checked, the students will be able to do submissions after the deadline is reached. These submissions won't affect the grade."
es: "Si está marcado, los estudiantes podrán hacer entregas después de que se alcance la fecha límite. Estos envíos no afectarán la calificación."

source: Never
es: Nunca

source: Always
es: Siempre

source: Custom, from: {} to: {}
es: Personalizado, desde: {} hasta: {}

source: Timeout limit (in seconds)
es: Tiempo límite (en segundos)

source: Hard timeout limit (in seconds) <small>Default to 3*timeout</small>
es: Timeout límite fuerte (en segundos) <small>Por defecto 3*timeout</small>

source: Memory limit (in megabytes)
es: Límite de memoria (en MegaBytes)

source: Output limit (in megabytes)
es: Límite de salida (en MegaBytes)

source: Grading environment
es: Entorno de evaluación

source: Allow internet access inside the grading container?
es: Acceso a internet en el ambiente de evaluación

source: Change grading environment
es: Entorno de evaluación
